Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/local_and_regional_government/county_or_city_manager.html.txt.tmx
Source language: en
Languages: ga

source: Since June 2014 every local authority has a chief executive (formerly called a county or city manager) who is employed to manage their local authority
ga: Ó Mheitheamh 2014, tá ag gach údarás áitiúil príomhfheidhmeannach (ar ar tugadh bainisteoir contae nó cathrach roimhe seo) atá fostaithe chun bainistiú a dhéanamh ar a n-údarás áitiúil

source: Some local authorities share a chief executive
ga: Bíonn an príomhfheidhmeannach céanna ag roinnt údaráis áitiúla

source: The chief executive performs the executive functions of the city council, county council or city and county council
ga: Tugann an príomhfheidhmeannach faoi fheidhmeanna feidhmiúcháin na comhairle cathrach, comhairle nó na comhairle contae nó na comhairle cathrach

source: He or she supervises, co-ordinates, manages and pays the employees and officers of the council
ga: Déanann sé nó sí maoirsiú, comhordú agus bainistiú ar fhostaithe agus ar oifigigh na comhairle, mar aon le hiad a íoc

source: He or she also makes contracts on behalf of the council and affixes the official seal of the council on documents
ga: Ina theannta sin, déanann sé nó sí conarthaí ar son na comhairle, mar aon le séala oifigiúil na comhairle a chur ar cháipéisí

source: The law (Local Government Act 2001 as amended by Section 54 of the Local Government Reform Act 2014) clearly states that “For every county, city and city and county there shall be a chief executive to be known as ‘the Chief Executive of.......’(followed by the name of the city council, county council or city and county council, as the case may be).”
ga: Luaitear sa dlí (an tAcht Rialtais Áitiúil, Act 2001 arna leasú ag Alt 54 den Acht Rialtais Áitiúil (Leasú), 2014) go soiléir “I gcás gach contae, cathrach agus cathair contae, beidh príomhfheidmeannach ar a dtabharfar ‘Príomhfheidhmeannach.....’ (agus ainm na comhairle cathrach, na comhairle contae nó na comhairle cathrach agus na comhairle contae ina dhiaidh sin, de réir mar a bheidh).”

source: As well as the chief executive, some councils also have deputy chief executives
ga: Mar aon leis an bpríomhfheidhmeannach, bíonn leas-phríomhfheidhmeannaigh ag roinnt comhairlí chomh maith

source: After consultation with the Cathaoirleach of the local authority, the chief executive may appoint a council employee as deputy chief executive to act on their behalf while they are on leave or absent
ga: Tar éis dul i gcomhairliúchán le Cathaoirleach an údaráis áitiúil, féadfaidh an príomhfheidhmeannach fostaí na comhairle a cheapadh mar leas-phríomhfheidhmeannach chun gníomhú thar a gceann fad a bhíonn siad ar saoire nó as láthair

source: In situations where the chief executive is temporarily unable to act and there is no deputy chief executive, Section 148 of the Local Government Act 2001, as amended by the 2014 Act, allows the cathaoirleach or the Minister for Housing, Planning, Community and Local Government to appoint a council employee as deputy chief executive temporarily
ga: I gcásanna nach bhfuil an príomhfheidhmeannach ar fáil chun gníomhú agus nuair nach bhfuil aon leas-phríomhfheidhmeannach ann, ceadaítear faoi Alt 148 den Acht Rialtais Áitiúil, 2001, arna leasú ag Acht 2014, don Chathaoirleach nó don Aire Tithíochta, Pleanála, Pobail agus Rialtais Áitiúil chun fostaí na comhairle a cheapadh mar leas-phríomhfheidhmeannach ar bhonn sealadach

source: This temporary appointment may be terminated at any time
ga: Féadtar deireadh a chur leis an gceapachán sealadach seo ag aon tráth ar bith

source: Chief executives are recruited through a competitive recruitment process organised by the Public Appointments Service
ga: Déantar príomhfheidhmeannaigh a earcú trí phróiseas earcaíochta iomaíche a eagraíonn an tSeirbhís um Cheapacháin Phoiblí

source: Where a position of chief executive becomes vacant the Minister is required to appoint someone to the position temporarily until a permanent appointment to the position is made
ga: Sa chás go mbíonn post príomhfheidhmeannaigh folamh, tá ar an Aire duine a cheapadh leis an bpost ar bhonn sealadach go dtí go ndéantar ceapachán buan leis an bpost

source: Such a temporary appointment may be terminated by the Minister at any time
ga: Féadfaidh an tAire deireadh a chur leis an gceapachán sealadach seo ag aon tráth ar bith

source: Once appointed, the chief executive will remain in office for a term of 7 years (although this can also be extended by an additional 3 years)
ga: A luaithe a cheaptar duine, fanfaidh an príomhfheidhmeannach san oifig ar feadh téarma 7 mbliana (cé gur féidir é seo a shíneadh le trí bliana bhreise)

source: The retirement age for chief executives is 65
ga: Is í aois scoir phríomhfheidhmeannach 65 bliain

source: If a council wishes to suspend or remove a chief executive, a resolution must be passed by the council
ga: Más mian le comhairle príomhfheidhmeannach a chur ar fionraí nó a dhífhostú, ní mór don chomhairle rún a rith

source: At least three-quarters of the councillors must vote for the resolution
ga: Ní mór do thrí cheathrú, ar a laghad, de na comhairleoirí vóta a chaitheamh i bhfabhar an rúin

source: The Minister then sanctions the removal of the chief executive
ga: Is féidir leis an Aire dífhostú an phríomhfheidhmeannaigh a cheadú ansin

source: Delegation of the chief executive’s functions
ga: Tarmligean fheidhmeanna an phríomhfheidhmeannaigh

source: It is normal practice that the chief executive of a local authority delegates some functions to other staff in the local authority
ga: Gnáthchleachtas is ea go ndéanfaidh príomhfheidhmeannach in údarás áitiúil roinnt feidhmeanna a tharmligean d’fhoireann eile san údarás áitiúil

source: The elected council must be notified of any delegated functions
ga: Ní mór fógra a thabhairt don chomhairle thofa i leith aon fheidhmeanna tarmligthe

source: However, the chief executive still remains responsible for the acts of the delegate and can take back (that is, revoke) a responsibility that has been delegated
ga: Is é an príomhfheidhmeannach, áfach, a bheidh freagrach as gníomhartha na toscaireachta agus féadfaidh sé/sí freagracht a ghlacadh air/uirthi féin arís (i.e

source: The chief executive has the ultimate responsibility for ensuring the local authority operates smoothly and for carrying into effect policy decisions of the elected council
ga: a chúlghairm) a rinneadh a tharmligean. Tá an fhreagracht iomlán ar an bpríomhfheidhmeannach as a chinntiú go bhfeidhmíonn an t-údarás áitiúil gan chur isteach agus a chinntiú go gcuirtear i bhfeidhm cinntí beartais na comhairle tofa
